cases/hygroscopicGrowth/constant/thermophysicalProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}

activeSpecies
(
    PG
    VG
    Water
);

inactiveSpecies
(
    Air
);

inertSpecie Air;

phaseMixing
{
    viscosity       continuousPhase;
    conductivity    mass;
    heatCapacity    mass;
}
