cases/hygroscopicGrowth/0.org/PG.dispersed
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Water.dispersed;
}

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.0005;

boundaryField
{
    walls
    {
        type        mixedAbsorbing;
        value       $internalField;
    }

    empties
    {
        type        empty;
    }
}
