cases/hygroscopicGrowth/0.org/Water.continuous
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Water.continuous;
}

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.0;

boundaryField
{
    walls
    {
        type        saturatedMixture;
        value       $internalField;

        #include    "saturatedMixtureParams"
    }

    empties
    {
        type        empty;
    }
}
