cases/hygroscopicGrowth/0.org/saturatedMixtureParams
S   1.0;

f
{
    PG      0.01;
    VG      0.01;
    Water   0.98;
}

g
{
    Air     1.0;
}
